Revit 2024 API
BuiltInFailures.SketchFailures.NoLoopsPath3d Property
 Sketch is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoLoopsPath3d { get; }
Visual Basic
Public Shared ReadOnly Property NoLoopsPath3d As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoLoopsPath3d {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace